[
   {
      "id": "1",
      "title": "Customer Acquisition and Retention Specialist",
      "location": "On the road",
      "description": "We are looking for a customer acquisition and Retention Specialist to join our team and help us retain our customers. The successful candidate will be responsible for developing and executing strategies to increase customer loyalty, identify customer needs, and develop customer relationships. The Retention Specialist will also be responsible for analyzing customer data to identify trends and opportunities for improvement, as well as providing feedback to the team on customer satisfaction.",
      "responsibility": [
         {
            "text": "Acquiring new Clients using various methods such as cold calling, email blasting, social method marking etc."
         },
         {
            "text": "Traveling to new prospective clients and with your expert knowledge of the company and the services we provide to establish a business-to-business relationship"
         },
         {
            "text": "Implement the company's strategic plan to bring in new clients and use the strategic plan to establish and maintain relationships with key clients and partners"
         },
         {
            "text": "Write and correspond with clients in regard to bids and must have expert knowledge of how to price projects and bids when square footage is not available"
         },
         {
            "text": "Visit job sites and record all leading notes needed for a proposal and report back to the leading manager"
         },
         {
            "text": "Ensure that all new, potential and current client questions concerns, and overall business relationship is strong"
         },
         {
            "text": "Develop and implement customer retention strategies."
         },
         {
            "text": "Analyze customer data to identify trends and opportunities for improvement."
         },
         {
            "text": "Manage customer feedback and complaints."
         },
         {
            "text": "Monitor customer satisfaction levels and respond to feedback accordingly."
         },
         {
            "text": "Develop customer engagement strategies to increase loyalty and retention."
         },
         {
            "text": "Conduct customer surveys and focus groups to identify areas of improvement."
         }
      ],
      "requirment": [
         {
            "text": "Must have a laptop, phone and car in order to apply."
         }
      ],
      "benefits": [],
      "jobType": "Full Time",
      "experience": "Marketing: 4 years (Required)",
      "communityAmbesdor": "",
      "qualifications": [],
      "additionalResponsibility": "",
      "joinOurTeam": ""
   },
   {
      "id": "2",
      "title": "Outside Sales Rep",
      "location": "N/A",
      "description": "",
      "responsibility": "",
      "requirment": [
         {
            "text": "Must have a valid drivers license and clean driving record Preferred Education and Experience"
         },
         {
            "text": "At least 5 years of janitorial/building maintenance sales experience"
         },
         {
            "text": "Experience in the service, cleaning or construction industries"
         },
         {
            "text": "Strong knowledge of practices and techniques."
         },
         {
            "text": "Associate's Degree or higher (preferred)"
         },
         {
            "text": "Must be proficient in building measurement and the proper use of the tools required to collect the square footage of buildings. Must have the ability to use the proper square footage tools."
         },
         {
            "text": "Seo and Email marketing skills"
         },
         {
            "text": "Expert knowledge of sales"
         },
         {
            "heading": "MATHEMATICAL SKILLS"
         },
         {
            "text": "Ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, a nd volume."
         },
         {
            "text": "Proven work experience as a sales representative"
         },
         {
            "text": "Excellent knowledge of Google Office"
         },
         {
            "text": "Familiarity with BRM and CRM practices along with ability to build productive business professional relationships "
         },
         {
            "text": "Highly motivated and target driven with a proven track record in sales"
         },
         {
            "text": "Excellent selling, communication and negotiation skills"
         },
         {
            "text": "Prioritizing, time management and organizational skills Work Authorization/Security Clearance Must be authorized to work in the United States and its territories. AAP/EEO Statement Company provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Further, the company takes affirmative action to ensure that applicants are employed, and employees are treated during employment without regard to any of these characteristics. Discrimination of any type will not be tolerated."
         },
         {
            "bold": "Other duties: ",
            "text": "Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice."
         }
      ],
      "benefits": [],
      "jobType": "Full Time",
      "communityAmbesdor": "",
      "experience": "Experienced/ Expert",
      "qualifications": [
         {
            "text": "Preferred Associates or Higher, but Not Required"
         }
      ],
      "additionalResponsibility": "",
      "joinOurTeam": ""
   },
   {
      "id": "3",
      "title": "Construction Cleaning Crew",
      "location": "N/A",
      "description": "",
      "responsibility": [
         {
            "text": "Remove all dust from surface dwellings."
         },
         {
            "text": "Clean and restock restrooms."
         },
         {
            "text": "Remove all window stickers and clean glass."
         },
         {
            "text": "Clean and polish all brightwork."
         },
         {
            "text": "Clean floors."
         },
         {
            "text": "Notify supervisor of building and equipment maintenance issues."
         },
         {
            "text": "Conduct all work in accordance with company policies and procedures."
         },
         {
            "text": "Wear supplied PPE as required."
         },
         {
            "text": "Other duties as assigned."
         }
      ],
      "requirment": [
         {
            "text": "Stable work history that demonstrates reliability and a strong work ethic."
         },
         {
            "text": "Ability to work independently or in a team environment."
         },
         {
            "text": "Attention to detail and a commitment to quality work."
         },
         {
            "text": "Ability to work on your feet for the duration of your shift."
         },
         {
            "text": "Ability to lift over 25 lbs on occasion."
         },
         {
            "text": "Must pass a criminal background check."
         }
      ],
      "communityAmbesdor": "",
      "qualifications": [
         {
            "text": "High school diploma or equivalent."
         },
         {
            "text": "Strong attention to detail and the ability to work efficiently to meet project deadlines."
         },
         {
            "text": "Knowledge of cleaning techniques, procedures, and equipment."
         },
         {
            "text": "Familiarity with the safe handling and use of cleaning chemicals."
         },
         {
            "text": "Physical fitness and the ability to perform manual labor in various weather conditions."
         },
         {
            "text": "Excellent time management skills and the ability to prioritize tasks effectively."
         },
         {
            "text": "Strong communication skills and the ability to work well both independently and as part of a team."
         },
         {
            "text": "Knowledge of safety guidelines and practices related to construction site cleaning."
         },
         {
            "text": "Valid driver's license and clean driving record."
         }
      ],
      "additionalResponsibility": "",
      "joinOurTeam": "",
      "benefits": [],
      "jobType": "Full Time",
      "experience": "Experienced/ Expert"
   },
   {
      "id": "4",
      "title": "Lawncare Employee",
      "location": "N/A",
      "description": "We are seeking a skilled and dedicated Lawncare Specialists to join our lawn care team. The ideal candidate will have experience operating lawn maintenance equipment, including lawnmowers, trimmers, and blowers, and possess knowledge of pruning decorative shrubs and plants. A high school degree or equivalent is required, and candidates must be at least 18 years old. Physical capabilities include standing, bending, and squatting for extended periods, along with the ability to lift up to 40 pounds. Responsibilities include mowing grass, pruning trees and shrubs, maintaining existing landscaping designs, planting new flora, and removing debris. Our team works in various weather conditions to ensure the safety and aesthetic appeal of our clients' exteriors. Additionally, responsibilities extend to overseeing equipment maintenance, conducting repairs, and adhering to safety protocols during inclement weather.",
      "responsibility": [],
      "requirment": [
         {
            "text": "At least 18 years old"
         },
         {
            "text": "Previous landscaping or groundskeeping experience is a plus (willing to train)"
         },
         {
            "text": "Proficiency in operating lawn maintenance equipment"
         },
         {
            "text": "Physical ability to stand, bend, squat, and lift up to 40 pounds"
         },
         {
            "heading": "For a Leadership Position"
         },
         {
            "text": "Ability to manage employees, project resources, and expectations"
         },
         {
            "text": "Excellent communication skills"
         },
         {
            "text": "Professional presentation and demeanor"
         },
         {
            "text": "Building consultative business relationships"
         },
         {
            "text": "Training, managing, and developing other employees"
         },
         {
            "text": "Strong understanding of plant material and turf, ability to sell enhancements"
         },
         {
            "text": "Passion for customer service and excellence"
         },
         {
            "text": "Valid driver's license and clean driving record"
         },
         {
            "text": "Ability to operate a truck and trailer safely"
         },
         {
            "text": "Proficient operation of all lawn service equipment"
         },
         {
            "heading": "Physical Requirements for Landcare Crew Members:"
         },
         {
            "text": "Ability to lift heavy materials regularly"
         },
         {
            "text": "Adherence to core values, including teamwork, positive attitude, flexibility, honesty, critical thinking, and respect Teamwork and collaboration with a crew"
         },
         {
            "text": "Physical endurance for standing, walking, kneeling, and crouching"
         },
         {
            "text": "Detail-oriented approach to landscape activities"
         },
         {
            "text": "Mechanical skills for operating landscaping machinery"
         },
         {
            "text": "Customer service excellence"
         },
         {
            "text": "Problem-solving skills for addressing plant diseases and design challenges"
         },
         {
            "text": "Strong communication skills, both verbal and written"
         },
         {
            "text": "Reliability, punctuality, and adherence to uniform standards"
         },
         {
            "text": "Safe driving with a valid license and clean record (experience with truck and trailer operation)"
         },
         {
            "text": "Lifting ability up to 50 pounds"
         }
      ],
      "communityAmbesdor": "",
      "qualifications": [
         {
            "text": "High school degree or equivalent"
         }
      ],
      "additionalResponsibility": "",
      "joinOurTeam": "",
      "benefits": [],
      "jobType": "Full Time",
      "experience": "Minimum of 3 years of industry experience"
   },
   {
      "id": "5",
      "title": "Window Cleaner",
      "location": "N/A",
      "description": "Are you in search of job security, a safe work environment, advancement opportunities, and a chance to fill the gap in your resume? Look no further! Our offices operate Monday to Friday, managing accounts with both business and residential clients. Join our window cleaning team and enjoy a friendly atmosphere, flexible work hours, and the assurance of no evening hours, or holidays. Whether working alone or in pairs, you'll spend over 50% of your time outdoors in the fresh air. As you become more efficient in this role, you'll find increased leisure time throughout the day. Apply today for a position that offers.",
      "responsibility": [],
      "requirment": [
         {
            "text": "Valid driver's license"
         },
         {
            "text": "Valid driver's license"
         },
         {
            "text": "Reliable transportation"
         },
         {
            "text": "Valid car insurance"
         },
         {
            "text": "Ability to provide excellent customer service"
         },
         {
            "text": "Previous experience in cleaning or custodial work"
         },
         {
            "text": "Ability to work at heights and use ladders or scaffolding"
         },
         {
            "text": "Attention to detail"
         },
         {
            "text": "Physical stamina for repetitive tasks and lifting heavy equipment if necessary"
         }
      ],
      "communityAmbesdor": "",
      "qualifications": "",
      "additionalResponsibility": "",
      "joinOurTeam": "",
      "benefits": [
         {
            "text": "No nights"
         },
         {
            "text": "Flexible hours"
         },
         {
            "text": "Full or part-time availability year-round"
         },
         {
            "text": "Inside and outside work"
         },
         {
            "text": "Furnished equipment and uniforms"
         }
      ],
      "jobType": "Full Time",
      "experience": ""
   },
   {
      "id": "6",
      "title": "Handyman Position",
      "location": "N/A",
      "description": "Seeking a skilled handyman to handle a variety of Service/Warranty repairs, including electrical, plumbing, drywall repair, paint, trim carpentry, flooring, etc. The successful candidate must have tools and reliable transportation, demonstrating dependability and the ability to work independently. If you are a reliable and skilled individual looking to showcase your construction and maintenance expertise, join our team of dedicated Handymen and become an essential part of our company's success",
      "responsibility": [
         {
            "text": "Have reliable transportation"
         },
         {
            "text": "Possess your own set of tools, or at least some tools"
         },
         {
            "text": "Work independently"
         },
         {
            "text": "Skills to supervise subcontractors on jobs"
         },
         {
            "text": "Monitor project progress and ensure quality control"
         },
         {
            "text": "Communicate effectively with team members and clients"
         },
         {
            "text": "Seeking a hard worker adaptable to different projects, adhering to schedules, and getting the job done"
         }
      ],
      "requirment": [
         {
            "text": "Essential: Must possess tools and reliable transportation"
         },
         {
            "text": "Required: Dependability and the ability to work independently"
         },
         {
            "text": "Handyman / General Maintenance Technician"
         },
         {
            "text": "Additional knowledge in plumbing and electrical work is advantageous"
         },
         {
            "text": "Must have personal tools and a vehicle"
         },
         {
            "text": "Versatility in efficiently handling a wide range of tasks with a strong commitment to quality work"
         },
         {
            "text": "Proven experience as a Handyman/Carpenter or in a similar role"
         },
         {
            "text": "Strong knowledge of construction processes, techniques, and materials"
         },
         {
            "text": "Excellent organizational and time management skills"
         },
         {
            "text": "Strong leadership and decision-making abilities"
         },
         {
            "text": "Ability to work well under pressure and meet deadlines"
         },
         {
            "text": "Effective communication and interpersonal skills"
         },
         {
            "text": "Highly motivated individual with a passion for construction and a proven track record of successfully managing projects"
         },
         {
            "text": "Full-time, hourly position"
         },
         {
            "text": "Serious inquiries only"
         },
         {
            "text": "Must provide own equiptment"
         },
         {
            "text": "Driver's License (Required)"
         }
      ],
      "sheduale": [
         {
            "text": "10-hour shift"
         },
         {
            "text": "8-hour shift"
         },
         {
            "text": "Day shift"
         },
         {
            "text": "Monday to Friday"
         },
         {
            "text": "Overtime"
         },
         {
            "text": "Weekends as needed"
         }
      ],
      "communityAmbesdor": "",
      "qualifications": "",
      "additionalResponsibility": "",
      "joinOurTeam": "",
      "benefits": [],
      "jobType": "Full Time",
      "experience": "Experienced/ Expert"
   },
   {
      "id": "7",
      "title": "Sales Associate, Estimator at America's Finest Maintenance",
      "location": "N/A",
      "description": "Are you a dynamic and motivated individual with a strong knack for sales? America's Finest Maintenance, the premier maintenance company, is actively seeking a Sales Associate/Estimator to join our dedicated team. As the largest and most esteemed window cleaning company in the industry, we take pride in offering top-notch services to our clients, and you can be a vital part of this endeavor.",
      "responsibility": [
         {
            "bold": "Sales and Business Growth:",
            "text": "You will have the opportunity to play a pivotal role in our continued growth and success. As a Sales Associate/Estimator, your responsibilities will include reaching out to prospective clients, providing them with free estimates, and converting them into valued customers. You will also be responsible for retaining and managing existing accounts, further enhancing our business's success."
         },
         {
            "bold": "Community Ambassador:",
            "text": "In this role, you will become the face of America's Finest Maintenance in your local community. This involves networking, attending local events, and skillfully managing our social media presence. Building strong relationships with clients and acting as a liaison between them and our company will be central to your responsibilities. 32.44 {plus commissions}"
         },
         {
            "bold": "Appointment Setting:",
            "text": "If you have a background in call center or appointment setting, your skills will be put to excellent use. You will be responsible for making outbound calls to set appointments for our outside sales representatives, ensuring that our sales team has a consistent stream of opportunities to pursue."
         },
         {
            "bold": "Professionalism and Communication:",
            "text": "Exceptional communication skills are a must, both in person and over the telephone. You should be able to listen to customer needs, offer suitable solutions, and represent our company professionally and accurately."
         }
      ],
      "requirment": [
         {
            "text": " 2-4 years of business-to-business and outside sales experience"
         },
         {
            "text": "Demonstrated self-motivation, strong work ethic, and goal-oriented mindset"
         },
         {
            "text": "Basic computer skills, including proficiency in MS Office"
         },
         {
            "text": "Outstanding interpersonal skills and an outgoing personality"
         },
         {
            "text": "Exceptional organizational abilities, effective time management, and a commitment to follow-up"
         },
         {
            "text": "Reliable transportation, a valid driver's license, and proof of insurance"
         },
         {
            "text": "Proficiency in Microsoft Office applications"
         },
         {
            "text": "Ability to work independently and collaboratively"
         },
         {
            "text": "Self-confidence, trustworthiness, and a results-driven approach"
         },
         {
            "text": "Willingness to undergo a background investigation and drug testing"
         },
         {
            "bold": "Additional Responsibilities:",
            "text": "Develop and maintain a customer base in the greater St. Pete, Largo, and Clearwater area, actively seeking self- generated leads"
         },
         {
            "text": "Converting prospective customers into new account starts and providing ongoing support and services"
         },
         {
            "text": "Building and nurturing business relationships through networking, face-to-face canvassing, cold calling, and other proven methods"
         },
         {
            "text": "Running scheduled appointments and cold calls, effectively meeting with prospects"
         },
         {
            "text": "Developing strong relationships with clients and acting as a liaison between customers and the company"
         },
         {
            "text": "Managing new customer start-up processes"
         },
         {
            "text": "Acquiring new residential and commercial customers for various cleaning services"
         },
         {
            "text": "Conducting sales calls during the day, evening, or weekends in the assigned territory"
         },
         {
            "text": "Presenting America's Finest Maintenance Company's services professionally and accurately"
         },
         {
            "text": "Keeping records of sales activities and maintaining sales material inventory"
         }
      ],
      "communityAmbesdor": "",
      "qualifications": "",
      "additionalResponsibility": "",
      "joinOurTeam": "America's Finest Maintenance offers a stimulating work environment and ample opportunities for career growth and development. If you are a highly motivated individual with a passion for sales and customer service, we invite you to apply and be part of our dedicated team. Become an integral part of our mission to provide top-quality window cleaning and maintenance services to our valued customers.America's Finest Maintenance is an equal opportunity employer, and we look forward to welcoming talented individuals to our team.",
      "benefits": [],
      "jobType": "Full Time",
      "experience": ""
   }
]